app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
	def index
  @posts = Post.order(created_at: :desc).page(params[:page])